Revit 2026 API

# KeyBasedTreeEntryFailures Properties

---

The BuiltInFailuresKeyBasedTreeEntryFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadClassificationLevel | Level [Level] of Classification [Code] is not an integer from 1 to 5. |
|  | CircularParentage | A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]' |
|  | DuplicateEntry | Duplicate code '[Code]', description: '[Description]' |
|  | MissingParent | No parent [EntryType] '[Code]' for '[Code]' |

#### Reference

BuiltInFailuresKeyBasedTreeEntryFailures Class

Autodesk.Revit.DB Namespace